import 'package:pr5/model/items.dart';

final List<Items> ItemsList = <Items>[
  Items(
      1,
      "Кружка \"Гусь\"",
      "https://ir.ozone.ru/s3/multimedia-1-3/wc1000/7110855183.jpg",
      600,
      "Материал: Полистоун\nРазмер: 380мл\nМожно мыть в посудомоечной машине.",
      false),
  Items(
      2,
      "Кружка керамическая",
      "https://ir.ozone.ru/s3/multimedia-1-j/wc1000/7075750735.jpg",
      500,
      "Материал: Керамика\nРазмер: 400мл\nМожно мыть в посудомоечной машине.",
      false),
  Items(
      3,
      "Кружка Доляна Клубника",
      "https://ir.ozone.ru/s3/multimedia-h/wc1000/6785147933.jpg",
      600,
      "Материал: Керамика, Силикон\nРазмер: 350мл\nМожно мыть в посудомоечной машине.",
      false),
  Items(
      4,
      "Кружка хамелеон Чеширский Кот",
      "https://ir.ozone.ru/s3/multimedia-0/wc1000/6294798312.jpg",
      400,
      "Материал: Керамика\nРазмер: 300мл\nОсобенность этой кружки в том, что она меняет свой цвет при нагревании. Можно мыть в посудомоечной машине.",
      false),
  Items(
      5,
      "Кружка металлическая \"Череп\"",
      "https://ir.ozone.ru/s3/multimedia-h/wc1000/6304198541.jpg",
      400,
      "Материал: Нержавеющая сталь\nРазмер: 400мл\nНельзя мыть в посудомоечной машине.",
      false),
  Items(
      6,
      "Кружка керамическая Доляна Twist",
      "https://ir.ozone.ru/s3/multimedia-1-j/wc1000/7090710499.jpg",
      400,
      "Материал: Керамика\nРазмер: 350мл\nНельзя мыть в посудомоечной машине.",
      false),
  Items(
      7,
      "Кружка фарфоровая \"Шины\"",
      "https://ir.ozone.ru/s3/multimedia-1-9/wc1000/7092772317.jpg",
      500,
      "Материал: Керамика\nРазмер: 460мл\nМожно мыть в посудомоечной машине.",
      false),
  Items(
      8,
      "Кружка с двойными стенками \"Cердце\"",
      "https://ir.ozone.ru/s3/multimedia-j/wc1000/6808645387.jpg",
      400,
      "Материал: Стекло, Боросиликатное стекло\nРазмер: 250мл\nМожно мыть в посудомоечной машине.",
      false),
  Items(
      9,
      "Starbucks Кружка",
      "https://ir.ozone.ru/s3/multimedia-1-8/wc1000/7107265016.jpg",
      3600,
      "Материал: Керамика\nРазмер: 355мл\nВращающееся, Двойные стенки. Можно мыть в посудомоечной машине.",
      false),
  Items(
      10,
      "Кружка керамическая Mushroom",
      "https://ir.ozone.ru/s3/multimedia-m/wc1000/6632228578.jpg",
      1600,
      "Материал: Керамика\nРазмер: 300мл\nКружка керамическая Mushroom Гриб из Супер Марио. Можно мыть в посудомоечной машине.",
      false),
];
